{
  "kitaplar": [
    {
      "id": 1,
      "kitapAdi": "Kafamda Bir Tuhaflık",
      "kitapKategori": "Edebiyat",
      "kitapYazari": "Orhan Pamuk",
      "sayfaSayisi": 480,
      "kitapResim": "https://img.kitapyurdu.com/v1/getImage/fn:5192424/wh:true/wi:220",
      "kitapAciklama": "Kafamda Bir Tuhaflık hem bir aşk hikâyesi hem de modern bir destan. Orhan Pamuk’un üzerinde altı yıl çalıştığı roman, bozacı Mevlut ile üç yıl aşk mektupları yazdığı sevgilisinin İstanbul’daki hayatlarını hikâye ediyor."
    },
    {
      "id": 2,
      "kitapAdi": "Kapsamlı Python Kursu",
      "kitapKategori": "Yazılım",
      "kitapYazari": "Eric Matthes",
      "sayfaSayisi": 608,
      "kitapResim": "https://static.ticimax.cloud/30373/uploads/urunresimleri/kapsamli-python-kursu-programlamaya-uy-3e965f.jpg",
      "kitapAciklama": "Kapsamlı Python Kursu, dünyada Python programlama dili için yazılmış en çok satan ve beğenilen kitaptır. Python ile programlamaya bu hızlı giriş sayesinde programlar yazacak, problemleri çözecek ve işlerinizi çabucak halledeceksiniz."
    },
    {
      "id": 3,
      "kitapAdi": " Hayatımızdaki Algoritmalar",
      "kitapKategori": "Yazılım",
      "kitapYazari": "Brian Christian, Tom Griffiths",
      "sayfaSayisi": 496,
      "kitapResim": "https://static.ticimax.cloud/30373/uploads/urunresimleri/hayatimizdaki-algoritmalar-gunluk-kararl-022b.jpg",
      "kitapAciklama": "Yaşamımızın tamamı, belirli bir sorun grubuna yol açan mekân ve zaman kısıtları ile sınırlandırılmıştır. Bir günde ya da ömrümüz boyunca ne yapmalı ya da ne yapmamalıyız? Ne kadar karışıklığı kabul etmeliyiz? Bunlar insanlar açısından içinden çıkılmaz durumlara benziyor olabilirler fakat öyle değiller: Bilgisayarlar da aynı kısıtlamalarla karşı karşıyalar, bu nedenle bilgisayar bilimciler onlarca yıldır bu tür sorunların farklı versiyonlarıyla uğraşmaktadır. Ve buldukları çözümlerin bize öğreteceği çok ama çok şey var.Ünlü yazar Brian Christian ve bilişsel bilim uzmanı Tom Griffiths disiplinlerarası bu çalışmasında, bilgisayarların kullandığı algoritmaların insanlığın birçok sorununu nasıl çözebileceğini göz kamaştırıcı biçimde okuyuculara sunuyor. Daha iyi sezgilere nasıl sahip olunacağını, işleri ne zaman bitirmemiz gerektiğini, yorucu ve sıkıntılı seçimlerle nasıl başa çıkacağımızı ve başkalarıyla en iyi nasıl ilişki kuracağımızı açıklıyorlar. Evlilik için en doğru kişiyi bulmaktan park yeri seçimine, kişinin e-posta gelen kutusunu düzenlemesinden belleğin işleyişini anlamaya kadar bu kitap, bilgisayar biliminin bilgeliğini insan hayatı için çok önemli stratejilere dönüştürüyor.Bu kitap kesinlikle mest edici… Genç matematik öğrencilerinden sıkça duyduğunuz ‘Neden ki? Bunu gerçek hayatta asla kullanmayacağım!’ argümanına karşı mükemmel bir panzehir. İster oyun teorisinin Yüzde 37 Kuralı olsun, isterse zihin-büküm olasılıklarının nispeten sade anlatımı, tüm iş burada sunulduğu kadar hem eğlenceli hem de pratik."
    },
    {
      "id": 4,
      "kitapAdi": "İnce Memed 1",
      "kitapKategori": "Edebiyat",
      "kitapYazari": "Yaşar Kemal",
      "sayfaSayisi": 352,
      "kitapResim": "https://r2.1k-cdn.com/sig/size:128/plain/https%3A%2F%2F1k-cdn.com%2Fresimler%2Fkitaplar%2F39535_AMRrt_1507312826.jpg",
      "kitapAciklama": "İnce Mehmed, köyünde zalim bir ağa tarafından haksızlığa uğramış bir köylüdür. Onun hikayesi, adaleti sağlamak için verdiği mücadeleyi anlatır ve unutulmaz karakterlerle dolu bir macera sunar."
    },
    {
      "id": 5,
      "kitapAdi": "Cumhuriyetin 100 Günü",
      "kitapKategori": "Tarih",
      "kitapYazari": "Emrah Safa Gürkan",
      "sayfaSayisi": 608,
      "kitapResim": "https://img.kitapyurdu.com/v1/getImage/fn:11707006/wh:true/wi:220",
      "kitapAciklama": "Bu kitap, yorgun bir imparatorluğun yüzlerce yıldır yapamadığını yapacak genç bir cumhuriyetin doğuşunun hikâyesi… Aksayan planların, kaygan ittifakların, saklanan niyetlerin, ama en nihayetinde tartışmasız bir zaferin öyküsü."
    },
    {
      "id": 6,
      "kitapAdi": "Şeker Portakalı",
      "kitapKategori": "Diğer",
      "kitapYazari": "Jose Mauro De Vasconcelos",
      "sayfaSayisi": 200,
      "kitapResim": "https://i.dr.com.tr/cache/500x400-0/originals/0000000064031-1.jpg",
      "kitapAciklama": "İç dünyanızda yaşayan biriyseniz Şeker Portakalı tam size göre! Hayal gücü geniş bir çocuk olan Zeze'nin hikâyesinin kaleme alındığı bu kitap, yazıldığı günden beri dünya çapında çokça okundu. Dünya klasikleri arasında yerini koruyan roman, yediden yetmişe her yaş grubuna da hitap ediyor. Okuyucuların kalbine işleyen Şeker Portakalı'na gelin, daha yakından göz atalım!"
    },
    {
      "id": 7,
      "kitapAdi": "Gazi Mustafa Kemal Atatürk",
      "kitapKategori": "Tarih",
      "kitapYazari": "İlber Ortaylı",
      "sayfaSayisi": 480,
      "kitapResim": "https://i.dr.com.tr/cache/500x400-0/originals/0001740229001-1.jpg",
      "kitapAciklama": "Gazi Mustafa Kemal Atatürk kitabı, evvela imparatorluğu dirilten nesil olan 1880'liler kuşağı, Balkan coğrafyası ve Mustafa Kemal'in aile kökeni ile başlıyor.Akabinde Atatürk’ün askeri eğitimi, Manastır yılları, Milliyetçilikler Dönemi, İttihat ve Terakki, II. Abdülhamid, Enver Paşa, Ziya Gökalp, Trablusgarb, Balkan Savaşları ve Sofya yıllarıyla devam ediyor.Ordumuzun İtilaf devletleriyle sekiz cephede mücadele ettiği Birinci Dünya Savaşı, kutlu zaferlerimiz Çanakkale ve Kutü’l Amâre, Mondros, son padişah Vahideddin, bir milletin ve ülkenin ölüm fermanı olan Sevr…Tüm detaylarıyla Milli Mücadele dönemi, 23 Nisan 1920 ve sonrasında muhalefete rağmen verilen Kurtuluş Savaşı, İnönü Muharebeleri, Lozan Konferansı, Büyük Taarruz ve Cumhuriyet’e giden yol...Saltanat ve hilafet tartışmaları, Lozan, On İki Ada, mübadele, Osmanlı'dan kalan borçlar, Musul ve yakın tarihin en önemli meselesi olan inkılablar...Son olarak kişisel özellikleriyle, dünyada, anılarda, hafızalarda kalan izleriyle modern Türkiye’nin kurucusu Atatürk...İlber Ortaylı bu ilk biyografisinde yaşamının tüm yönleriyle büyük lider Gazi Mustafa Kemal Atatürk'ü anlatıyor. Türk tarihçiliğine hiç unutulmayacak ve sürekli başvurulacak bir rehber kitap daha kazandırıyor..."
    },
    {
      "id": 8,
      "kitapAdi": "Tongue Fu",
      "kitapKategori": "Diğer",
      "kitapYazari": "Sam Horn",
      "sayfaSayisi": 289,
      "kitapResim": "https://r2.1k-cdn.com/sig/size:128/plain/https%3A%2F%2F1k-cdn.com%2Fresimler%2Fkitaplar%2F332663_dccdd_1552245370.jpg",
      "kitapAciklama": "- İnsanlararası iletişimde husumeti, anlaşmazlıkları ve yanlış anlamaları uyuma dönüştürmek, Sözlü çatışmalardan, ağız kavgalarından ve sinir patlamalarından kaçınmak,Sözünüzü, insanlarla huzurlu bir birlikteliğin aracı haline getirmek istemez misiniz?Sözlü dövüş sanatı Tongue Fu size bütün bunların yolunu gösteriyor.Tongue Fu ile şu teknikleri kolaylıkla öğrenebilirsiniz:- Unutmanız gereken sözler ve kullanmanız gereken hangileridir?- Haklısınız demenin muazzam dönüştürücü gücünden nasıl yararlanabilirsiniz?- Sözel zorbalarla nasıl başa çıkabilirsiniz?- Başkaları bamtelinize dokunduğunda ne yapabilirsiniz?- Onurunuzu koruyarak münakaşalardan nasıl sıyrılabilirsiniz?- Ne diyeceğinizi bilmediğinizde ne diyebilirsiniz?- Susmayı kendi yararınıza nasıl kullanabilirsiniz?- Duygularınızı nasıl kontrol edebilirsiniz?"
    },
    {
      "id": 9,
      "kitapAdi": "Elon Musk",
      "kitapKategori": "Diğer",
      "kitapYazari": "Ashlee Vance",
      "sayfaSayisi": 462,
      "kitapResim": "https://static.ticimax.cloud/30373/uploads/urunresimleri/elon-musk-tesla-spacex-ve-muhtesem-gelec-e6e2.jpg",
      "kitapAciklama": "1971 doğumlu genç bir girişimcinin şirketleri ile dünyadaki otomotiv, uzay-havacılık ve enerji sektörlerindeki yerleşik düzene meydan okumasının sıra dışı hikâyesidir."
    },
    {
      "id": 10,
      "kitapAdi": "Stoacının Günlüğü",
      "kitapKategori": "Diğer",
      "kitapYazari": "Stephen Hanselman",
      "sayfaSayisi": 432,
      "kitapResim": "https://r2.1k-cdn.com/sig/size:128/plain/https%3A%2F%2F1k-cdn.com%2Fresimler%2Fkitaplar%2F1010667_a139e_1619956364.jpg",
      "kitapAciklama": "Mutluluğa nasıl kavuşuruz? Öfkemizi kontrol etmenin en etkili yolu nedir? Başarının gerçek ölçütü ne olmalıdır? Kederimizin üstesinden gelip hayatımıza nasıl bir anlam katabiliriz? Tüm bu soruların ve daha fazlasının cevabı Stoacı felsefenin özünü oluşturur. İşte Stoacının Günlüğü de bu antik bilgeliği temel alan faydalı bir rehber görevi görüyor.Sanatçılardan aktivistlere, imparatorlardan savaş kahramanlarına kadar tarihin büyük isimlerinin gizli silahı olan Stoacılık prensipleri, eyleme geçmek isteyenlerin felsefesi olarak yüzyıllar boyu bir ışık gibi parladı. İnsan deneyiminin laboratuvarında son iki bin yıldır test edilen bu zamansız bilgiler modern hayatın karmaşasını anlamlandırabilmek adına oldukça önemli.Bu kitapta yılın her bir günü için İmparator Marcus Aurelius’un, Seneca’nın ve Epiktetos’un yazdıklarından yola çıkılarak Stoacı egzersizler ile deneyimler paylaşılıyor ve okuyucular her gün için ayrı ayrı tarihî anekdotlar, bu anekdotlar üzerine düşündürücü yorumlar ve Antik Yunan kültürüne ait, hayatı kolaylaştıran bakış açılarıyla karşılaşıyor. Bir yıl boyunca bu kitaptaki Stoacı öğretileri takip ederek siz de hayatın güçlükleri karşısında daha yapıcı çözümler bulabileceğiniz huzurlu, dingin bir zihne kavuşabilirsiniz."
    },
    {
      "id": 11,
      "kitapAdi": "İktidar-Güç Sahibi Olmanın 48 Yasası",
      "kitapKategori": "Diğer",
      "kitapYazari": "Robert Greene",
      "sayfaSayisi": "622",
      "kitapResim": "https://i.dr.com.tr/cache/500x400-0/originals/0000000077265-1.jpg",
      "kitapAciklama": "Gücü elde etmek isteyenlere, gücün esiri olanlara ya da güce karşı direnenlere... Güç Sahibi Olmanın 48 Yasası Kimi gücünün zirvesindeyken ölümcül bir hatayla elindekini yitirir. Kimi çok ileri gider veya yeterince ilerleyemez. Fakat kimileri de doğru adımı atarak insanüstü bir gayretle gücü kendilerine çeker. Tarih boyunca yazarlar ve filozoflar kendilerine şu soruyu sormuşlardır; bizden öncekilerin başarılarından ya da hatalarından ne gibi dersler alabiliriz? Üç bin yıllık süre içinde güç hakkındaki çeşitli yazıları hep aynı konuları işlemiş, gücün özünü tanımlayarak nasıl arttırılacağını ve yönetileceğini veya nasıl yok edileceğini tarif etmiştir. Gücün 48 Yasası zihinlerden sonsuza dek silinmeyecektir."
    }
  ],
  "kategoriler": [
    {
      "kategoriId": 0,
      "kategoriAdı": "Tüm Kitaplar"
    },
    {
      "kategoriId": 1,
      "kategoriAdı": "Yazılım"
    },
    {
      "kategoriId": 2,
      "kategoriAdı": "Edebiyat"
    },
    {
      "kategoriId": 3,
      "kategoriAdı": "Tarih"
    },
    {
      "kategoriId": 4,
      "kategoriAdı": "Diğer"
    }
  ]
}